# ЗАДАЧА
# Вывести самую длинную строку

# РЕШЕНИЕ
text1 = input('Введите текст 1: ')
text2 = input('Введите текст 2: ')
text3 = input('Введите текст 3: ')

print(max(text1, text2, text3))