# ЗАДАЧА
# Выведите на экран
# Glo Academy
#
# Glo Academy
# Сделайте это разными способами:
# 1. с помощью трех команд print
# 2. с помощью одной команды print


# РЕШЕНИЕ
#print('Glo Academy\n\nGlo Academy')
print('Glo Academy', 'Glo Academy', sep='\n\n')

print('Glo Academy')
print()
print('Glo Academy')
