# Задача
# Спросите пользователя его имя, а затем поздоровайтесь с ним.
# 1. Спросите его “Как тебя зовут?”
# 2. Получите от него ответ в виде его имени
# 3. Поздоровайтесь с ним “Привет, {имя пользователя}”

# РЕШЕНИЕ
name = input('Как тебя зовут?\n')
print('Привет,', name)
