# ЗАДАЧА
# Напишите программу, которая выводит "Hello, GloAcademy!" (без кавычек) 25 раз.

# РЕШЕНИЕ
for i in range(5):
    print('Hello, GloAcademy!')